Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: "Hamas' rockets can kill people and they have," a counter-intelligence veteran of the U.S., CIA who spent his career monitoring Israeli and Palestinian military capabilities, told me recently, "but compared to what the Israelis are using, the Palestinians are firing bottle rockets." ↑ The Growing Reach of Hamas's Rockets. The New York Times. July 2014 ↑ "Hamas Rockets from Gaza Target Haifa, Reach Far into Northern Israel".
ne: "Hamas' rockets can kill people and they have," a counter-intelligence veteran of the U.S., CIA who spent his career monitoring Israeli and Palestinian military capabilities, told me recently, "but compared to what the Israelis are using, the Palestinians are firing bottle rockets." ↑ The Growing Reach of Hamas's Rockets.

source: Washington Free Beacon.
ne: The New York Times.

source: Retrieved July 17, 2015..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Gaza: Palestinian Rockets Unlawfully Targeted Israeli Civilians". hrw.org/news/. Human Rights Watch. Retrieved 11 July 2014..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Israel/PA: Suicide Bombers Commit Crimes Against Humanity.
ne: July 2014 ↑ "Hamas Rockets from Gaza Target Haifa, Reach Far into Northern Israel", Washington Free Beacon, अभिगमन मिति जुलाई १७, २०१५। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Gaza: Palestinian Rockets Unlawfully Targeted Israeli Civilians", hrw.org/news/, Human Rights Watch, अभिगमन मिति ११ जुलाई २०१४। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Israel/PA: Suicide Bombers Commit Crimes Against Humanity.

source: 119. ↑ "The Covenant of the Islamic Resistance Movement (Hamas)". MidEast Web. August 18, 1988..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Hamas Islamic Resistance".
ne: 119. ↑ "The Covenant of the Islamic Resistance Movement (Hamas)", MidEast Web, अगस्ट १८, १९८८। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Hamas Islamic Resistance".

source: Hamas (Arabic: حماس Ḥamās, an acronym of حركة المقاومة الاسلامية Ḥarakat al-Muqāwamah al-ʾIslāmiyyah Islamic Resistance Movement) is a Palestinian Sunni-Islamist fundamentalist organization.[9][10] It has a social service wing, Dawah, and a military wing, the Izz ad-Din al-Qassam Brigades. It has been the de facto governing authority of the Gaza Strip since its takeover of that area in 2007.[11][12] During this period it fought several wars with Israel.[13] It is regarded, either in whole or in part, as a terrorist organization by several countries and international organizations, most notably by Israel, the United States and the European Union.[14][15][16] Russia, China, and Turkey are among countries who do not regard it so.[17][18][19][20]
ne: हमास (अरबी: حماس Ḥamās, an संक्षिप्त حركة المقاومة الاسلامية Ḥarakat al-Muqāwamah al-ʾIslāmiyyah ) प्यालेस्टाइनको सुन्नी is a Palestinian Sunni-इस्लामिक कट्टरपन्थी संघठन हो । [9][10] यो संग यसको समाज सेवा बिभाग दवाह र सैन्य बिभाग इज दिन अल कास्सम ब्रिगेड रहेको छ। यो गाजा पट्टीलाई २००७ मा कब्जा गरे देखि त्यस क्षेत्रको अघोषित शासकीय निकाय रहेको छ । [11][12] यो अबधिमा यसले इजरायल संग धेरै युद्ध लड्यो । [13] यो संघठनलाई कयौं राष्ट्र तथा अन्तरास्ट्रिय संगठनले ,मुख्यतः इजरायल ,संयुक्त राज्य अमेरिका,र युरोपेली संघ, पूर्ण वा आंशिक आतंकबादी संगठन मान्छ । [14][15][16] रसिया , चीन र टर्की यो नमान्ने केहि देशहरु हुन् ।[17][18][19][20]

source: Hamas was founded in 1987,[21][22] soon after the First Intifada broke out, as an offshoot of the Egyptian Muslim Brotherhood,[23][24] which in its Gaza branch had been non-confrontational towards Israel, refrained from resistance, and was hostile to the PLO.[25] Co-founder Sheik Ahmed Yassin stated in 1987, and the Hamas Charter affirmed in 1988, that Hamas was founded to liberate Palestine, including modern-day Israel, from Israeli occupation and to establish an Islamic state in the area that is now Israel, the West Bank and the Gaza Strip.[26][27] The group has stated that it may accept a 10-year truce if Israel withdraws to the 1967 borders and allows Palestinian refugees from 1948, including their descendants, to return to what is now Israel,[28][29][30][31] although clarifying that this does not mean recognition of Israel or the end of the conflict.[32] Hamas's military wing objected to the truce offer.[33] Analysts have said that it seems clear that Hamas knows that many of its conditions for the truce could never be met.[34]
ne: हमासको स्थापना इजेप्टेली संगठन मुस्लिम ब्रदरहूडको शाखाको रुपमा १९८७ मा भएको थियो ।[23][24] यो सुरु देखि नै इजरायल प्रति शत्रुतापूर्ण , प्रतिरोधी र प्यालेस्टिनी मुक्ति संगठन पि.एल.ओ. बिरोधि रहेको थियो ।[25] सह-संथापक शेख अहमद यासिनको भनाइ १९८७ अनुसार र हमासको बडापत्र १९८८ को अनुसार हमासको स्थापना इजरायली अधिनस्थबाट प्यालेस्टाइनको मुक्ति र हालको इजरायल, पश्चिमी तट र गाजा पट्टीमा इस्लामिक राज्यको निर्माणको लागि भएको थियो ।[26][27]

source: The military wing of Hamas has launched attacks against Israeli civilians and soldiers, often describing them as retaliatory, in particular for assassinations of the upper echelon of their leadership.[35] Tactics have included suicide bombings and, since 2001, rocket attacks.[36][37][38][39] Hamas's rocket arsenal, though mainly consisting of short-range homemade Qassam rockets,[40] also includes long-range weapons that have reached major Israeli cities including Tel Aviv and Haifa.[41][42] The attacks on civilians have been condemned as war crimes and crimes against humanity by human rights groups such as Human Rights Watch.[43][44] A 2017 Palestinian Center for Public Opinion poll in the Palestinian territories revealed that Hamas violence and rhetoric against Israelis are unpopular and that a majority of Palestinians would rather Hamas "accept a permanent two-state solution based on the 1967 borders."[45]
ne: हमासको सैन्य बिभागले आफ्ना उच्च नेताको हत्याको बदला लिनको लागि इजरायली नागरिक र सैनिकमाथि आक्रमण शृंखला चलाएको थियो ।[35] यसको रणनीतिमा आत्मघाती बम बिस्फोट र , २००१ देखि रकेट आक्रमणहरु समावेश छन् ।[36][37][38][39] हमासको रकेट शस्त्रशालामा विशेषगरि छोटो दुरीको रकेटहरु छन् [40] र लामो दुरीको रकेट पनि रहेका छन् जुन मुख्य इजरायली शहर तेल अबिब र हैफालाई निसाना बनाउन सक्छ ।[41][42] नागरिक माथि गरिएका आक्रमणलाई मानव अधिकार समुह जस्तै ह्युमन राइट वाचले युद्ध अपराध र मानवता विरुद्धको अपराधको रुपमा लिने गरेको छ । [43][44] २०१७ मा प्यालेस्टिनी भूभागमा गरिएको गरिएको एक सर्वेक्षण अनुसार हमासको हिंसा अलोकप्रिय छ ।[45]

source: In the January 2006 Palestinian parliamentary elections, Hamas won a plurality in the Palestinian Parliament,[46] defeating the PLO-affiliated Fatah party. Following the elections, the Quartet (the United States, Russia, United Nations, and European Union) made future foreign assistance to the PA conditional upon the future government's commitment to non-violence, recognition of the state of Israel, and acceptance of previous agreements. Hamas rejected those changes, which led to the Quartet suspending its foreign assistance program and Israel imposing economic sanctions on the Hamas-led administration.[47][48] In March 2007, a national unity government headed by Prime Minister Ismail Haniyeh of Hamas was briefly formed, but this failed to restart international financial assistance.[49] Tensions over control of Palestinian security forces soon erupted in the 2007 Battle of Gaza,[49] after which Hamas took control of Gaza, while its officials were ousted from government positions in the West Bank.[49] Israel and Egypt then imposed an economic blockade of the Gaza Strip, on the grounds that Fatah forces were no longer providing security there.[50] In 2011, Hamas and Fatah announced a reconciliation agreement that provides for creation of a joint caretaker Palestinian government.[51] Progress stalled, until an April 2014 agreement to form a compromise unity government, with elections to be held in late 2014.[52]
ne: २००६ को जनवरीमा भएको प्यालेस्टिनी संसदीय निर्वाचनमा, हमासले प्यालेस्टिनी संसदमा पि.एल.ओ सम्बद्ध फताह पार्टीलाई पराजित गर्दै बहुमत हासिल गर्यो । [46] उक्त निर्वाचन पछी , चौकडी ( अमेरिका , रसिया , संयुक्त राष्ट्र संघ र युरोपेली संघ ) ले अहिंसा, इजरायललाई मान्यता दिने र पुर्व सम्झौताको पालाना गर्ने भावी सरकारको प्रतिबद्धता सर्तमा बैदेशिक सहायता गर्ने प्रस्ताव गरेको थियो । हमासले उक्त प्रस्ताव अस्विकार गरे पछी चौकडीले बैदेशिक सहायता बन्द गर्यो र इजरायलले हमास नेतृत्वको प्रशासन माथि आर्थिक प्रतिबन्ध लगायो ।[47][48] २००७ मार्च मा , हमासको प्रधानमन्त्री इस्माइल हनियेह नेतृत्वको राष्ट्रिय एकताको सरकार बन्यो , तर अन्तर्राष्ट्रिय सहयोग जुटाउन असफल रह्यो । [49] प्यालेस्टिनी सुरक्षा बलको नियन्त्रणको बिषयलाई लिएर तनाब उत्पन भयो र २००७ मा गाजाको लडाई भयो ।[49] त्यसपछि गाजाको नियन्त्रण हमासको हातमा आयो ।[49] इजरायल र इजिप्टले त्यसपछि गाजापट्टीमा आर्थिक नाकाबन्दी गरे ।[50] २०११ मा, हमास र फताहले गठबन्धन गर्ने सम्झौता गरे र त्यो बाट संयुक्त कामचलाउ प्यालेस्टिनी सरकार गठन भयो ।[51]

source: Hamas is an acronym of the Arabic phrase حركة المقاومة الاسلامية or Harakat al-Muqāwama al-Islāmiyya, meaning "Islamic Resistance Movement". The Arabic word 'hamas' (حماس) means "courage" or "zeal".[53] The Hamas covenant interprets its name to mean "strength and bravery".[54][55]
ne: हमास ( अरबी भाषा حركة المقاومة الاسلامية or Harakat al-Muqāwama al-Islāmiyya,) को आर्थ "इस्लामिक प्रतिरोधी आन्दोलन" हुन्छ . अरबिक शब्द "हमास" (حماس) को अर्थ " साहस" हुन्छ । [53] [54][55]

source: Royal titles Preceded by Aishwarya Queen Consort of Nepal 2001–2008 Vacant Title next held by Monarchy Abolished
ne: शाही शीर्षक पुर्वाधिकारी ऐश्वर्या नेपालको महारानी 2001-2008 रिक्त उत्तराधिकारी राजतन्त्र Abolished

source: Patronages
ne: संरक्षण

source: Abolition of the monarchy
ne: राजतन्त्रको अन्त्य

source: Komal Rajya Lakshmi Devi Shah (born 18 February 1951) is the Queen consort of King Gyanendra of Nepal. She was the last Queen consort of Nepal before the Monarchy was abolished on 28 May 2008.
ne: कोमल राज्य लक्ष्मी देवी शाह (जन्म २००७ फागुन ७ ) नेपालको महारानी थिइन् । उनी २०६५ जेठ १५ मा नेपालको राजतन्त्र अन्त्य हुनु अघि नेपालको अन्तिम महारानी थिइन् ।

source: Queen Komal was born in Bagmati, Kathmandu into the Rana family, the daughter of Kendra Shumsher Jang Bahadur Rana (1927–1982) and his wife Shree Rajya Lakshmi Devi Shah (1928–2005).[1] Queen Komal's older sister Aishwarya was married to King Birendra of Nepal, the brother of Gyanendra. Aishwarya was killed in the palace massacre on 1 June 2001. Komal sustained bullet injuries as a result of the palace shooting and spent four weeks recovering in hospital.[2]
ne: रानी कोमल को जन्म बागमती, काठमाडौंमा राणा परिवार मा (पिता केन्द्र शमशेर जबरा (१९८४-२०९३ ) र आमा श्री राज्य लक्ष्मी देवी शाह (१९८५-२०६२ )) भएको थियो । [1] रानी कोमल को दिदी ऐश्वर्य को बिवाह राजा वीरेन्द्र संग भएको थियो । २०५८ जेठ २८ मा भएको दरवार हत्याकाण्ड मा ऐश्वर्यको हत्या भएको थियो । कोमल त्यस घटनामा घाइते भएकी थिइन् र अस्पतालमा चार हप्ता बिताउनु परेको थियो ।[2]

source: Thailand : Dame Grand Cordon of the Order of the White Elephant (1979) France : Dame Grand Cross of the National Order of Merit (02/05/1983)[8] Spain : Dame Grand Cross of the Order of Isabella the Catholic (13/11/1987)[9]
ne: Thailand : ह्वाइट इलाफेन्ट (1979) France : नेसनल अडर अफ मेरिट (02/05/1983)[8] Spain : इसाबेल द क्याथोलिक(13/11/1987)[9]

source: As a result of the massacre, Komal's husband Gyanendra succeeded to the throne following the deaths of King Birendra, Crown Prince Dipendra (who had briefly succeeded him), and Prince Nirajan. Komal thus became Queen of Nepal.[3]
ne: हत्याकाण्डमा राजा बिरेन्द्र , युवराज दिपेन्द्र र राजकुमार निराजन वीर विक्रम शाहको हत्या भएपछी राजगद्दीमा उनका पति ज्ञानेद्र बसे । यसरि कोमल महारानी बनिन् ।[3]

source: Komal's younger sister Prekshya also married into the Shah dynasty marrying Gyanendra and Birendra's brother Prince Dhirendra who was killed in the palace massacre. They divorced in 1991.[4] Princess Prekshya was killed in a helicopter crash on 12 November 2001.
ne: कोमलको बहिनि प्रेक्षाको बिबाह अधिराजकुमार धिरेन्द्र संग भएको थियो । धिरेन्द्रको हत्या दरबार हत्याकाण्डमा भएको थियो भने प्रेक्षाको मृत्यु हेलिकप्टर दुर्घटनामा भएको थियो । उनीहरुको २०४६ मा सम्बन्ध विच्छेद भएको थियो ।[4]

source: Queen Komal married her second cousin Prince Gyanendra of Nepal on 1 May 1970 in Kathmandu, and they have two children.
ne: उनको बिबाह अधिराजकुमार ज्ञानेन्द्र शाहसँग बैशाख १८, २०२७ भएको थियो । उनीहरुको दुई सन्तान थिए ।

source: Crown Prince Paras (born on 30 December 1971 in Kathmandu). Princess Prerana (born on 20 February 1978 in Kathmandu).
ne: युवराज पारस शाह ( जन्म : पौष १५, २०२८) राजकुमारी प्रेरणा (जन्म फाल्गुण ९, २०३४)

source: The Nepalese Parliament voted on 28 December as part of a peace deal with former Maoist rebels, 270-3 in favour of abolishing the monarchy.[5]
ne: २०६५ जेठ १५ मा राजतन्त्र औपचारिक रुपमा अन्त्य भयो र संघीय गणतन्त्र स्थापना भयो ।[5]

source: Patron Association of St Mary's Alumnae Nepal. Chairman of the Pashupati Area Development Trust (PADT). President of the SOS Children's Villages-Nepal (2001).
ne: राज सभा सदस्य (२०३४) पशुपति क्षेत्र विकास कोष अध्यक्ष

source: National Honours
ne: राष्ट्रिय सम्मान

source: Member of Order of Gorkha Dakshina Bahu (1975) Member of the Order of Om Rama Patta (1980)[7] Member of the Order of Tri Shakti Patta (1998) Member of the Order of Nepal Pratap Bhaskara (17/10/2001) Member of the Order of Ojaswi Rajanya (07/04/2004) King Mahendra Investiture Medal (02/05/1956) Vishesh Seva [Distinguished Service Medal] (1971) King Birendra Investiture Medal (24/02/1975) Commemorative Silver Jubilee Medal of King Birendra (31/01/1997) Vishista Seva [Distinguished Service Medal] (1999) King Gyanendra Investiture Medal (04/06/2001)
ne: गोरखा दक्षिण बाहु (1975) ओम राम पट्ट (1980)[7] त्रिशक्ति पट्ट (1998) नेपाल प्रताप भास्कर (17/10/2001) ओजस्वी राज्य (07/04/2004) राजा महेन्द्र राज्याभिषेक पदक (02/05/1956) विशेष सेवा (1971) राजा बिरेन्द्र राज्याभिषेक पदक (24/02/1975) राजा बिरेन्द्रको गद्दी आरोहण रजत महोत्सव पदक (31/01/1997) विशेष सेवा (1999) राजा ज्ञानेन्द्र राज्याभिषेक पदक (04/06/2001)

source: Foreign Honours
ne: विदेशी सम्मान

source: Queen Komal of Nepal
ne: रानी कोमल

source: Rise to power
ne: शक्तिमा उदय

source: Premiership
ne: प्रधानमन्त्री

source: Personal life
ne: व्यक्तिगत जीवन

source: Early politics
ne: सुरुको राजनीति

source: Chandrika Bandaranaike Kumaratunga (Sinhalese: චන්ද්‍රිකා බණ්ඩාරනායක කුමාරතුංග,Tamil: சந்திரிகா பண்டாரநாயக்க குமாரதுங்க; born 29 June 1945) is a Sri Lankan politician who served as the fifth President of Sri Lanka, from 12 November 1994 to 19 November 2005. The country's only female president to date, she is the daughter of two former prime ministers and was the leader of the Sri Lanka Freedom Party (SLFP) until the end of 2005.[1][2][3] In 2015 she was appointed as the chairperson of office for national unity and reconciliation.[4]
ne: चन्द्रिका कुमारातुंगा (Sinhalese: චන්ද්‍රිකා බණ්ඩාරනායක කුමාරතුංග,Tamil: சந்திரிகா பண்டாரநாயக்க குமாரதுங்க; जन्म २९ जुन १९४५) एक श्रीलङ्काली राजनीतिज्ञ हुन् जसले १२ नोबेम्बर १९९४ देखि १९ नोबेम्बर २००५ सम्म श्रीलंकाको पाँचौ राष्ट्रपतिको रुपमा सेवा गरिन् । अहिलेको मिति सम्म उनी देशको एक मात्र महिला राष्ट्रपति हुन् । उनी २००५ सम्म श्रीलंका फ्रिडम पार्टी (SLFP) को नेता समेत भाइन् । [1][2][3] २०१५ मा उनी राष्ट्रिय एकता तथा पुननिर्माण कार्यालयको अध्यक्ष चयन भइन् ।[4]

source: Chandrika with Sri Lankan diplomat Tissa Wijeyeratne in Paris, early 1970s
ne: चन्द्रिका र श्रीलंकाली कुटनीतिज्ञ तिस्सा विजेयेरत्ने , पेरिसमा १९७० को पूर्वार्ध
